Revit 2027 API
BoundaryConditions.SetOrientTo Method
 Sets the boundary condition orientation option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOrientTo(
	BoundaryConditionsOrientTo orientTo
)
Public Sub SetOrientTo (
	orientTo As BoundaryConditionsOrientTo
)
public:
void SetOrientTo(
	BoundaryConditionsOrientTo orientTo
)
member SetOrientTo :
        orientTo : BoundaryConditionsOrientTo -> unit
Parameters
orientTo BoundaryConditionsOrientTo
 The new orientation option.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace